ТОИР_демо/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/торо_УстановкаЦелевыхЗначенийПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаЦелевыхЗначенийПоказателейKPI</name>
  <registerRecords>InformationRegister.торо_ЦелевыеЗначенияKPI</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.торо_ПоказателиKPI</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОграниченоПоВремени</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_ЦелевыеЗначенияKPI/торо_ЦелевыеЗначенияKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЦелевыеЗначенияKPI</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КритическоеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_УстановкаЦелевыхЗначенийПоказателейKPI/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
	
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("КлючевыеПоказатели", НСтр("ru = 'Ключевые показатели'"));
	торо_ОбщегоНазначения.ПроверитьЗаполненностьТабличныхЧастей(ЭтотОбъект, СписокТЧ, Отказ);
	Если отказ тогда возврат; КонецЕсли;
	
	масОшибок = Новый Массив;
	Для Каждого ТекСтрока Из КлючевыеПоказатели Цикл
		Если текСтрока.ЗначениеПоказателяОграниченоПоВремени = Истина
			И текСтрока.ДатаПо < Дата тогда
			
			Отказ = истина;
			масОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для показателя %1 указана дата меньше даты документа. Документ не может быть проведен!'"),ТекСтрока.Показатель));
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ = Истина Тогда
		Для каждого текОшибка из масОшибок цикл
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(текОшибка);
		КонецЦикла;
	КонецЕсли;
	
	Движения.торо_ЦелевыеЗначенияKPI.Записывать = Истина;
	Движения.торо_ЦелевыеЗначенияKPI.Очистить();
	Для Каждого ТекСтрока Из КлючевыеПоказатели Цикл
		Движение = Движения.торо_ЦелевыеЗначенияKPI.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Подразделение = ТекСтрока.Подразделение;
		Движение.ОбъектРемонта = ТекСтрока.ОбъектРемонта;
		Движение.Показатель = ТекСтрока.Показатель;
		Движение.Значение = ТекСтрока.ЗначениеПоказателя;
		Движение.КритическоеЗначение = ТекСтрока.КритическоеЗначениеПоказателя;
		Движение.ДатаПо = ?(ТекСтрока.ЗначениеПоказателяОграниченоПоВремени, ТекСтрока.ДатаПО, '39991231235959');
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#КонецЕсли
